package org.example;

import java.util.Arrays;
import java.util.List;

public class Lection8_Arrays {

    public static void main(String[] args) {

        /** У Java масив (array) є структурою даних, яка дозволяє зберігати кілька елементів того ж типу в одній змінній.
        Вони представляють собою упорядковану колекцію елементів одного типу, яка має фіксовану довжину.

        Масиви в Java можна класифікувати за різними ознаками проте найперше на що варто звернути увагу
        - це кількість вимірів:

        Одновимірні масиви:
        Масиви, що містять одну послідовність елементів (якщо кажуть просто “масив” - скоріш за все, мова саме про
        цю структуру даних)

        Двовимірні, тривимірні тощо:
        Масиви, у яких елементами є інші масиви. Наприклад, двовимірний масив - це масив масивів, тривимірний -
        масив масивів масивів, і так далі.

         Зберігання в пам'яті
         Одновимірні масиви зберігаються в пам'яті у послідовно розташованих блоках.
         Кожен елемент масиву займає однаковий обсяг пам'яті, що дає ефективний доступ до елементів за допомогою індексів.
         **/

        //Оголошення та ініціалізація масиву цілих чисел
        int[] numbers = {10, 20, 30, 40, 50};
        int[] numbers2 = new int[] {10, 11, 12};
        int[] numbers3 = new int[2]; //довжина не може бути змінена

        // Спроба доступу до неіснуючого елемента
        int element = numbers2[3]; // Генерує виключення ArrayIndexOutOfBoundsException

        // Виведення елементів масиву на екран
        System.out.println("Елементи масиву чисел:");
        for (int i = 0; i < numbers.length; i++) {
            System.out.println("Елемент[" + i + "]: " + numbers[i]);
        }

        // Оголошення та ініціалізація масиву рядків
        String[] cars = {"Toyota", "Honda", "Ford", "Chevrolet"};

        // Виведення елементів масиву рядків на екран
        System.out.println("\nЕлементи масиву машин:");
        for (String car : cars) {
            System.out.println("Машина: " + car);
        }

        /**
         * Клас java.util.Arrays----------------------------------------------------------------------------------------
         */

        //toString():
        //Повертає рядкове представлення масиву.

        int[] example1 = {1, 2, 3, 4, 5};
        System.out.println(Arrays.toString(example1));

        //sort():
        //Сортує елементи масиву в порядку зростання.

        int[] example2 = {5, 2, 9, 1, 5};
        Arrays.sort(example2);

        //binarySearch():
        //Проводить бінарний пошук елемента у відсортованому масиві та повертає його індекс, якщо елемент знайдено,
        //або від'ємне число, якщо елемент відсутній.

        int[] example3 = {1, 2, 3, 4, 5};
        int index = Arrays.binarySearch(example3, 3);

        //copyOf() і copyOfRange():
        //copyOf() створює копію масиву до заданої довжини.
        //copyOfRange() створює копію певного діапазону масиву.

        int[] source = {1, 2, 3, 4, 5};
        int[] copy = Arrays.copyOf(source, source.length);
        int[] partialCopy = Arrays.copyOfRange(source, 1, 3); // Копіює з індексу 1 до індексу 2 (не включаючи)

        //equals():
        //Порівнює два масиви на рівність за їхнім вмістом.

        int[] arr1 = {1, 2, 3};
        int[] arr2 = {1, 2, 3};
        boolean isEqual = Arrays.equals(arr1, arr2);

        //fill():
        //Заповнює весь масив одним і тим же значенням.

        int[] example4 = new int[5];
        Arrays.fill(numbers, 10);

        //asList():
        //Повертає List, який заснований на заданому масиві.

        String[] words = {"apple", "banana", "orange"};
        List<String> list = Arrays.asList(words);
    }
}
